# калькулятор:

# a = float(input("цыфра1: "))
# o = input("+ или - или * или / : ")
# b = float(input("цыфра2: "))

# if o == "+":
#      print(a, o, b,"=", a + b)
# elif o == "-":
#      print(a, o, b,"=", a - b)
# elif o == "*":
#      print(a, o, b,"=", a * b)
# elif o == "/":
#      print(a, o, b,"=", a / b)
# else:
#      print("Иза того что вы написали не +, -, *, / а чтото тругое мы будем плюсовать.")
#      print(a, o, b,"=", a + b)

#----------------------------------------------------------------------------------------------
# создание своих функций

# def summa(a, b):
#     return a + b


# res = summa(5.5, 7.5)
# print(res)
# print(summa("H", "i"))

#----------------------------------------------------------------------------------------------
# код с моей созданой функции

# a = float(input("word = 10 Введите цыфру для функции word чтобы сплюсовать: "))
# b = float(input("world = 10 Введите цыфру для функции world чтобы сплюсовать: "))

# def avtor(word, world):
#     word = 10
#     world = 10
#     word += a
#     world += b
#     print("Вот что вы впысали и мы) сплюсовали это:")
#     print("word: ", word)
#     print("world: ", world)

# avtor(1, 2)
#----------------------------------------------------------------------------------------------
# функция для проверки + - * или / (для калькуляторов или трукого)
# п = переменая

# def testor():
#     if o == "+":
#         print(п, п, п,"=", п + п)
#     elif o == "-":
#         print(п, п, п,"=", п - п)
#     elif o == "*":
#         print(п, п, п,"=", п * п)
#     elif o == "/":
#         print(п, п, п,"=", п / п)
#     else:
#         print("Иза того что вы написали не +, -, *, / а чтото тругое мы будем плюсовать.")
#         print(п, п, п,"=", п + п)

# testor()
#----------------------------------------------------------------------------------------------