# 2️⃣ Возраст через 5 лет

# Задача:
# Пользователь вводит свой возраст. Выведи, сколько ему будет через 5 лет.

a = 5
b = int(input("Введите сколько вам лет: "))
a += b
print("Через 5 лет вам будет", a, "лет!")