# 4️⃣ Проверка пароля

# Задача:
# Если пользователь ввёл пароль 1234 — напиши «Доступ разрешён», иначе — «Неверный пароль».

a = input("Введите пароль: ")

if a == "1765":
    print("Доступ разрешен.")
else:
    print("Неправильный пароль.")