# 9️⃣ Сумма чисел

# Задача:
# Посчитай сумму всех чисел от 1 до числа, которое ввёл пользователь.

a = 0
b = int(input("Введите число: "))
while a <= b:
    print(a)
    a += 1