# Задача:
# Если возраст пользователя 18 или больше — можно голосовать, иначе нет.

a = int(input("Введите сколько вам лет цыфрами: "))

if a >= 18:
    print("Вы можете голосовать.")
else:
    print("Вы не можете голосовать.")