# 8️⃣ Таблица умножения

# Задача:
# Пользователь вводит число. Выведи таблицу умножения для него от 1 до 10.

for a in range(1):
    a = int(input("Выведите число для a: "))
    b = int(input("Выведите число для b: "))
    print(a * b)