# 1️⃣ Приветствие

# Задача:
# Попроси у пользователя имя и выведи приветствие с этим именем.

a = str(input("Введите важе имя: "))
print("Привет", a, end="!")